{
  "general": {
    "image_missing": "Image missing",
    "cookies_policy": "cookies policy",
    "legal_notice": "legal notice",
    "terms_conditions": "terms & conditions",
    "highlights": "highlights",
    "all_catalogue": "all catalogue",
    "loading": "Loading...",
    "temporal_txt_checkout1": "At this time, it is not possible to make purchases directly from the website.",
    "temporal_txt_checkout2": "If you want to place an order, contact us through ",
    "rights_reserved": "All rights reserved.",
    "contact": "contact"
  },
  "navbar": {
    "shop": "shop",
    "view_all": "view all",
    "tops": "tops",
    "bottoms": "bottoms",
    "runaway_pieces": "runaway pieces",
    "universe": "universe",
    "about": "about"
  },
  "bag": {
    "your_bag": "Your Bag",
    "color": "Color",
    "bag_is_empty": "Your bag is empty (for now)",
    "read_accepted": "I declare that I have read and accept the",
    "privacy_policy": "privacy policy",
    "privacy_required": "You must accept the privacy policy to continue",
    "total": "Total",
    "checkout": "Checkout",
    "size": "Size",
    "checkout_error": "There was an error during checkout. Please try again.",
    "remove": "Remove",
    "success_title": "Thank you for your purchase!",
    "success_message": "We have received your order and are processing it. We will send you a confirmation email with the details of your purchase.",
    "success_back_to_shop": "Return to store",
    "item_added": "Product added to your bag",
    "view_bag": "View bag ",
    "max_quantity_reached": "Maximum quantity for this item reached",
    "product_removed": "Product removed from your bag",
    "payment_pending_title": "We're still verifying your payment",
    "payment_pending_message": "Your checkout session is still pending. If you already completed the payment, please wait a few minutes or contact us with the payment ID below.",
    "payment_failed_title": "We couldn't confirm your payment",
    "payment_failed_message": "Stripe marked this session as cancelled or failed. Please try again or reach out with the payment ID below.",
    "payment_status_label": "Status",
    "payment_amount_label": "Amount",
    "payment_id_label": "Payment ID",
    "payment_try_again": "If the charge appears on your statement, contact us and share the ID above."
  },
  "collection": {
    "no_images_found": "No images found for this collection."
  },
  "product": {
    "add_to_bag": "add to bag",
    "loading_product": "Loading product...",
    "product_not_found": "Product not found",
    "which_size": "Which size should I choose?",
    "select_size_validation": "Please select a size before adding to the bag",
    "details": "Details",
    "materials": "Materials",
    "garment_care": "Garment Care"
  },
  "footer": {
    "title": "Contact Cillán for any inquiries",
    "comments": "Enter your comments",
    "send": "SEND",
    "email": "Enter your email"
  },
  "about": {
    "is_the": "is the",
    "inner_world": "inner world",
    "p_1_1": "of children, the duality between the complexity of developing a personality and having fun during childhood, realizing that all references are valid for enrichment and that one can never be too curious. Understood through irony and play, one",
    "never": "never",
    "p_1_2": "stops being a child.",
    "born_as": "is born as an",
    "alter_ego": "alter ego",
    "p_2": ", representing what we are supposed to leave behind but refuse to lose. It is the hidden version we all have in adulthood, embodying creativity, fun, and freedom from prejudice."
  },
  "legal_notice": {
    "title": "Legal Notice",
    "last_updated": "Last updated: January 14, 2026",
    "introduction": "Welcome to the Legal Notice of Cillan World S.L. (hereinafter, \"Cillan World\" or \"the Company\"). This document sets out the legal terms and conditions under which we operate our website and related services. By accessing or using our website, you agree to comply with these terms and conditions.",
    "identification": "Website Owner Identification",
    "titular_identification": "Owner identification",
    "company_name": "Name and legal entity: Cillán García",
    "company_id": "Tax ID (NIF): 50249775L",
    "company_address": "Registered office: Calle Lopez de Hoyos 124, 28002 Madrid, Spain",
    "contact_email": "Contact email: cillan.world@gmail.com",
    "object": "Purpose",
    "p1": "This legal notice governs the use of the website and the services offered by the owner. Below is the corporate information required by applicable regulations.",
    "p2_1": "This website aims to inform about products and allow the purchase of items offered by",
    "p2_2": "Access implies acceptance of the terms of use published on this website.",
    "intellectual_property": "Intellectual Property",
    "p3_1": "The content, images, designs, and trademarks are owned by",
    "p3_2": "or by third-party licensors. Reproduction without express authorization is prohibited.",
    "contact": "Contact",
    "p4": "For any questions related to the website or this legal notice, write to"
  }
  ,
  "cookies_notice": {
    "title": "Cookies policy",
    "last_updated": "Last updated: January 14, 2026",
    "p1": "This policy describes the cookies used on this website and the options available to manage them. It is consistent with the cookie banner and complies with GDPR and LSSI.",
    "what_are_cookies": "What are cookies",
    "p2": "Cookies are small files stored on your device that help remember preferences or improve the browsing experience.",
    "cookies_we_use": "Cookies we use",
    "p3": "We currently only use technical cookies necessary for the site to function. We do not use analytics or advertising cookies.",
    "p4": "It remembers the selected language. Approximate duration: 12 months. Type: technical.",
    "third_party_cookies": "Third-party cookies",
    "p5": "We do not set third-party cookies on this website. If they are added in the future, the banner will request your consent before enabling them.",
    "how_to_manage_cookies": "How to manage or block cookies",
    "p6": "You can allow, block, or delete cookies in your browser settings. Note that blocking technical cookies may affect the proper functioning of the site.",
    "more_info": "More information",
    "p7_1": "For any questions about privacy or cookies, write to ",
    "p7_2": "You can also check the",
    "contact_email": "cillan.world@gmail.com"
  }
  ,
  "terms_conditions": {
    "title": "Terms and Conditions",
    "last_updated": "Last updated: January 14, 2026",
    "p1": "Welcome to the CILLÁN world. By accessing and using our website and/or making a purchase, you agree to be bound by the following Terms and Conditions. We recommend that you read them carefully before using our services.",
    "subtitle1": "1. General Information",
    "p2": "This website is operated by Sergio Cillán García. Throughout the site, the terms “we,” “our,” or “the store” refer to CILLÁN.",
    "emails": "Contact email: cillan.world@gmail.com",
    "fiscal_direction": "Physical address: Calle Lopez de Hoyos 124. 28002",
    "subtitle2": "2. Use of the website",
    "p3_1": "By using this site, you declare that you are at least 18 years old or legally authorized to make online purchases in your country of residence.",
    "p3_2": "You may not use our products for illegal or unauthorized purposes or violate any laws in your jurisdiction (including, but not limited to, copyright).",
    "subtitle3": "3. Products and availability",
    "P4_1": "All products shown in our store are subject to availability. We reserve the right to withdraw or modify products without prior notice.",
    "P4_2": "Product colors may vary slightly depending on the user's screen settings.",
    "subtitle4": "4. Pricing and payment",
    "P5_1": "Todos los precios están indicados en euros (€) e incluyen IVA, salvo que se indique lo contrario.",
    "P5_2": "Aceptamos pagos seguros a través de Braintree, mediante tarjetas de crédito y débito. El cargo se realizará en el momento de confirmar el pedido.",
    "subtitle5": "5. Shipping and Delivery",
    "P6_1": "Shipments are made via the postal service. The estimated delivery time is 7 to 10 business days from order confirmation, due to on-demand production.",
    "P6_2": "Shipping costs are calculated and displayed before you finalize your purchase.",
    "subtitle6": "6. Changes and Returns",
    "P7_1": "We accept returns within 14 calendar days of receiving the order, provided the product has not been used and is in its original packaging.",
    "P7_2": "To request a return, please write to cillan.world@gmail.com indicating the order number and reason.",
    "P7_3": "Return shipping costs are the responsibility of the customer, unless the product is defective or there has been an error on our part.",
    "subtitle7": "7. Intellectual Property",
    "P7": "All content on this site (text, images, logos, web design, etc.) is the property of CILLÁN or is licensed for use. Its reproduction, in whole or in part, is prohibited without prior authorization.",
    "subtitle8": "8. Responsibility",
    "P8_1": "We are not responsible for damages resulting from misuse of the products or from the customer's failure to follow care, size or usage instructions.",
    "P8_2": "Under no circumstances will we be liable for indirect losses, lost profits, or damages resulting from technical failures of the website.",
    "subtitle9": "9. Data protection",
    "P9": "We respect your privacy and process your personal data in accordance with our",
    "subtitle10": "10. Modifications",
    "P10": "We reserve the right to modify these Terms and Conditions at any time. Changes will be effective upon posting on this page.",
    "subtitle11": "11. Applicable law and jurisdiction",
    "P11": "These terms and conditions are governed by Spanish law. In the event of a dispute, both parties agree to submit to the jurisdiction of the courts of Madrid, Spain, unless otherwise provided by law.",
    "subtitle12": "12. Contact",
    "P12": "For any questions or complaints, you can write to us at:",
    "p12_1": "cillan.worls@gmail.com",
    "p12_2": "Calle Lopez de Hoyos 124. 28002",
    "privacy_policy": "privacy policy"
  }
  ,
  "privacy_policy": {
    "title": "Privacy Policy",
    "last_updated": "Last updated: January 14, 2026",
    "p1": "At CILLÁN (hereinafter, “we” or “the store”), we take the protection of your personal data very seriously. This Privacy Policy describes how we collect, use, and protect your information when you browse or make a purchase on our website. By using our site, you agree to the practices described in this policy.",
    "subtitle1": "1. Who we are",
    "p2": "We are an online store of designer clothing and exclusive products. You can contact us through:" ,
    "p2_1": "Email: cillan.world@gmail.com",
    "p2_2": "Data Controller:  Sergio Cillán García",
    "subtitle2": "2. What personal data do we collect?",
    "p3": "We collect the following information when you browse our site or make a purchase:",
    "p3_1": "Full name" ,
    "p3_2": "Shipping and billing address",
    "p3_3": "Email address",
    "p3_4": "Phone number (optional)",
    "p3_5": "Payment information (via Braintree)",
    "p3_6": "IP address and browsing data (automatically through basic cookies)",  
    "subtitle3": "3. What do we use your data for?",
    "p4": "We use your data for:",
    "p4_1": "Processing and managing your orders" ,
    "p4_2": "Sending confirmations and updates via email",
    "p4_3": "Responding to your inquiries and requests",
    "p4_4": "Complying with legal obligations (invoicing, returns, etc.)",
    "p4_5": "Improving the user experience on our store",
    "subtitle4": "4. What is the legal basis for processing your data?",
    "p5": "In accordance with the General Data Protection Regulation (GDPR), the legal bases are:",
    "p5_1": "Performance of a contract (to process your orders)" ,
    "p5_2": "Consent (when you agree to receive communications)",
    "p5_3": "Legal obligation (invoice retention, for example)",
    "p5_4": "Legitimate interest (fraud prevention, service improvement)",
    "subtitle5": "5. Who do we share your data with?",
    "p6": "We only share your data with third parties essential to operating our store:",
    "p6_1": "Braintree, Inc., to process payments. You can review their privacy policy here: https://www.paypal.com/cy/legalhub/braintree/braintree-privacy-policy?utm_campaign=Braintree_Migration&utm_medium=Website&utm_source=Braintree#__Overview",
    "p6_2": "We do not sell or share your personal data with third parties for commercial purposes.",
    "subtitle6": "6. Use of cookies",
    "p7": "This site uses technical cookies necessary for its operation. We currently do not use third-party cookies for analytics or advertising. If we do, we will notify you appropriately and request your consent.",
    "subtitle7": "7. What are your rights?",
    "p8_1": "You can exercise the following rights at any time:",
    "p8_2": "Access your personal data",
    "p8_3": "Request the rectification or deletion of your data",
    "p8_4": "Limit or object to processing",
    "p8_5": "Request data portability",
    "p8_6": "Withdraw your consent, if previously given",
    "p8_7": "To exercise them, write to us at cillan.world@gmail.com with the subject “Data Protection”.",
    "p8_8": "You can also file a complaint with the Spanish Data Protection Agency: https://www.aepd.es",
    "subtitle8": "8. Data Security",
    "p9": "We adopt technical and organizational measures to protect your personal data, including SSL encryption, secure payment platforms (such as Braintree), and internal access controls.",
    "subtitle9": "9. Data Retention",
    "p10": "We retain your data only for as long as necessary to fulfill the purposes indicated and to comply with legal obligations (such as retaining invoices for 5 years).",
    "subtitle10": "10. Changes to this policy",
    "p11": "We reserve the right to modify this policy to adapt it to legislative or technical developments. The date of the last update will appear at the beginning of the document.",
    "subtitle11": "11. Contact",
    "p12": "For any questions related to this policy, you can write to us at:",
    "email": "cillan.world@gmail.com",
    "address": "Calle Lopez de Hoyos 124. 28002"
  }
}
