{
  "general": {
    "image_missing": "Image missing",
    "cookies_policy": "cookies policy",
    "legal_notice": "legal notice",
    "terms_conditions": "terms & conditions",
    "highlights": "highlights",
    "all_catalogue": "all catalogue",
    "loading": "Loading...",
    "temporal_txt_checkout1": "At this time, it is not possible to make purchases directly from the website.",
    "temporal_txt_checkout2": "If you want to place an order, contact us through ",
    "rights_reserved": "All rights reserved.",
    "contact": "contact"
  },
  "navbar": {
    "shop": "shop",
    "view_all": "view all",
    "tops": "tops",
    "bottoms": "bottoms",
    "runaway_pieces": "runaway pieces",
    "universe": "universe",
    "about": "about"
  },
  "bag": {
    "your_bag": "Your Bag",
    "color": "Color",
    "bag_is_empty": "Your bag is empty (for now)",
    "read_accepted": "I declare that I have read and accept the",
    "privacy_policy": "privacy policy",
    "privacy_required": "You must accept the privacy policy to continue",
    "total": "Total",
    "checkout": "Checkout",
    "size": "Size",
    "checkout_error": "There was an error during checkout. Please try again.",
    "remove": "Remove",
    "success_title": "Thank you for your purchase!",
    "success_message": "We have received your order and are processing it. We will send you a confirmation email with the details of your purchase.",
    "success_back_to_shop": "Return to store",
    "item_added": "Product added to your bag",
    "view_bag": "View bag ",
    "max_quantity_reached": "Maximum quantity for this item reached",
    "product_removed": "Product removed from your bag",
    "payment_pending_title": "We're still verifying your payment",
    "payment_pending_message": "Your checkout session is still pending. If you already completed the payment, please wait a few minutes or contact us with the payment ID below.",
    "payment_failed_title": "We couldn't confirm your payment",
    "payment_failed_message": "Stripe marked this session as cancelled or failed. Please try again or reach out with the payment ID below.",
    "payment_status_label": "Status",
    "payment_amount_label": "Amount",
    "payment_id_label": "Payment ID",
    "payment_try_again": "If the charge appears on your statement, contact us and share the ID above."
  },
  "collection": {
    "no_images_found": "No images found for this collection."
  },
  "product": {
    "add_to_bag": "add to bag",
    "loading_product": "Loading product...",
    "product_not_found": "Product not found",
    "which_size": "Which size should I choose?",
    "select_size_validation": "Please select a size before adding to the bag",
    "details": "Details",
    "materials": "Materials",
    "garment_care": "Garment Care"
  },
  "about": {
    "is_the": "is the",
    "inner_world": "inner world",
    "p_1_1": "of children, the duality between the complexity of developing a personality and having fun during childhood, realizing that all references are valid for enrichment and that one can never be too curious. Understood through irony and play, one",
    "never": "never",
    "p_1_2": "stops being a child.",
    "born_as": "is born as an",
    "alter_ego": "alter ego",
    "p_2": ", representing what we are supposed to leave behind but refuse to lose. It is the hidden version we all have in adulthood, embodying creativity, fun, and freedom from prejudice."
  },
  "legal_notice": {
    "title": "Legal Notice",
    "last_updated": "Last updated: January 14, 2026",
    "introduction": "Welcome to the Legal Notice of Cillan World S.L. (hereinafter, \"Cillan World\" or \"the Company\"). This document sets out the legal terms and conditions under which we operate our website and related services. By accessing or using our website, you agree to comply with these terms and conditions.",
    "identification": "Website Owner Identification",
    "titular_identification": "Owner identification",
    "company_name": "Name and legal entity: Cillan World S.L.",
    "company_id": "Tax ID (NIF): B12345678",
    "company_address": "Registered office: Calle de la Moda 123, 28001 Madrid, Spain",
    "contact_email": "Contact email: cillan.world@gmail.com",
    "object": "Purpose",
    "p1": "This legal notice governs the use of the website and the services offered by the owner. Below is the corporate information required by applicable regulations.",
    "p2_1": "This website aims to inform about products and allow the purchase of items offered by",
    "p2_2": "Access implies acceptance of the terms of use published on this website.",
    "intellectual_property": "Intellectual Property",
    "p3_1": "The content, images, designs, and trademarks are owned by",
    "p3_2": "or by third-party licensors. Reproduction without express authorization is prohibited.",
    "contact": "Contact",
    "p4": "For any questions related to the website or this legal notice, write to"
  }
  ,
  "cookies_notice": {
    "title": "Cookies policy",
    "last_updated": "Last updated: January 14, 2026",
    "p1": "This policy describes the cookies used on this website and the options available to manage them. It is consistent with the cookie banner and complies with GDPR and LSSI.",
    "what_are_cookies": "What are cookies",
    "p2": "Cookies are small files stored on your device that help remember preferences or improve the browsing experience.",
    "cookies_we_use": "Cookies we use",
    "p3": "We currently only use technical cookies necessary for the site to function. We do not use analytics or advertising cookies.",
    "p4": "It remembers the selected language. Approximate duration: 12 months. Type: technical.",
    "third_party_cookies": "Third-party cookies",
    "p5": "We do not set third-party cookies on this website. If they are added in the future, the banner will request your consent before enabling them.",
    "how_to_manage_cookies": "How to manage or block cookies",
    "p6": "You can allow, block, or delete cookies in your browser settings. Note that blocking technical cookies may affect the proper functioning of the site.",
    "more_info": "More information",
    "p7_1": "For any questions about privacy or cookies, write to ",
    "p7_2": "You can also check the",
    "contact_email": "cillan.world@gmail.com"
  }
  ,
  "terms_conditions": {
    "title": "Terms and Conditions",
    "last_updated": "Last updated: January 14, 2026",
    "p1_1": "These conditions govern the use of the online store operated by",
    "p1_2": "from",
    "p1_3": "By accessing or purchasing you expressly accept these terms.",
    "emails": "Email contacts",
    "fiscal_direction": "Registered office",
    "selling_conditions": "Conditions of sale",
    "p2_1": "All prices include VAT in euros.",
    "p2_2": "The order is considered accepted when you receive the payment confirmation.",
    "p2_3": "Payments are processed exclusively through Stripe.",
    "shipping_returns": "Shipping and returns",
    "p3_1": "We work with",
    "p3_2": "The estimated delivery time is 2 to 5 business days in mainland Spain. You have 14 calendar days to request a return by writing to",
    "p3_3": "The product must be in perfect condition and in its original packaging.",
    "intellectual_property": "Intellectual property",
    "p4_1": "All site content (texts, images, logos) belongs to",
    "p4_2": "or to third-party licensors. It may not be reused without authorization.",
    "data_protection": "Data protection",
    "p5": "We process personal data in accordance with our",
    "applicable_law": "Applicable law",
    "p6": "These terms are governed by Spanish law and any dispute will be resolved before the courts and tribunals of Madrid (Spain).",
    "contact_for_claims": "Contact for complaints",
    "contact": "Contact"
  }
  ,
  "privacy_policy": {
    "title": "Privacy Policy",
    "last_updated": "Last updated: January 14, 2026",
    "p1_1": "In",
    "p1_2": "we process your data in accordance with the General Data Protection Regulation. We operate from",
    "p1_3": "and you can contact us at",
    "p1_4": "This policy summarizes what data we collect, why we use it, and how you can exercise your rights.",
    "data_collected": "Data we collect",
    "p2_1": "Identification data (name, surname, email, and optional phone).",
    "p2_2": "Shipping and billing addresses.",
    "p2_3": "Payment information processed entirely by external payment providers.",
    "p2_4": "Technical browsing data (IP, language, device) to improve the service.",
    "legal_base": "Purposes and legal basis",
    "p3_1": "Contract performance: manage orders, shipping, returns, and support.",
    "p3_2": "Legal obligations: invoicing and accounting.",
    "p3_3": "Legitimate interest: improve the service, security, and prevent fraud.",
    "p3_4": "Consent: sending marketing communications and promotions.",
    "data_processors": "Processors and recipients",
    "p4_1": "External payment providers to process your transactions securely.",
    "p4_2": "Correos Express Paqueteria Urgente, S.A. for logistics and delivery of orders.",
    "p4_3": "We do not sell or transfer personal data to third parties for commercial purposes.",
    "user_rights": "User rights",
    "p5_1": "You can request access, rectification, erasure, restriction, portability, or objection at any time by emailing",
    "p5_2": "with the subject \"Data protection\". If you believe we have not addressed your rights, you can file a complaint with the Spanish Data Protection Agency.",
    "security_retention": "Security and retention",
    "p6": "We apply TLS encryption, access controls, and periodic reviews to protect your data. We retain information only as long as necessary to provide the service and comply with legal obligations (e.g., invoices for five years).",
    "contact": "Contact",
    "email": "Email:",
    "address": "Address:"
  }
}
