{
  "general": {
    "image_missing": "Falta la imagen",
    "cookies_policy": "politica de cookies",
    "legal_notice": "aviso legal",
    "terms_conditions": "términos y condiciones",
    "highlights": "destacados",
    "all_catalogue": "todo el catálogo",
    "loading": "Cargando...",
    "temporal_txt_checkout1": "Por el momento no es posible realizar compras directamente desde la web.",
    "temporal_txt_checkout2": "Si deseas realizar un pedido, contáctanos a través de ",
    "rights_reserved": "Todos los derechos reservados.",
    "contact": "contacto"
  },
  "navbar": {
    "shop": "tienda",
    "view_all": "ver todo",
    "tops": "prendas superiores",
    "bottoms": "prendas inferiores",
    "runaway_pieces": "piezas de pasarela",
    "universe": "universo",
    "about": "about"
  },
  "bag": {
    "your_bag": "Tu Cesta",
    "color": "Color",
    "bag_is_empty": "Tu cesta está vacía (por ahora)",
    "read_accepted": "Declaro haber leído y aceptado la",
    "privacy_policy": "política de privacidad",
    "privacy_required": "Debes aceptar la política de privacidad para continuar",
    "total": "Total",
    "checkout": "Finalizar compra",
    "checkout_error": "No hemos podido iniciar el pago. Inténtalo de nuevo.",
    "size": "Talla",
    "remove": "Eliminar",
    "success_title": "¡Gracias por tu compra!",
    "success_message": "Hemos recibido tu pedido y estamos procesándolo. Te enviaremos un correo electrónico de confirmación con los detalles de tu compra.",
    "success_back_to_shop": "Volver a la tienda",
    "item_added": "Producto añadido a tu cesta",
    "view_bag": "Ver cesta",
    "max_quantity_reached": "Se ha alcanzado la cantidad máxima para este artículo",
    "product_removed": "Producto eliminado de tu cesta",
    "payment_pending_title": "Estamos verificando tu pago",
    "payment_pending_message": "Tu sesión de pago todavía no figura como pagada. Si ya completaste el proceso, espera unos minutos o contacta con nosotros con el ID de pago.",
    "payment_failed_title": "No hemos podido confirmar tu pago",
    "payment_failed_message": "La sesión aparece como cancelada o fallida. Si crees que es un error, vuelve a intentarlo o escríbenos indicando el ID de pago.",
    "payment_status_label": "Estado",
    "payment_amount_label": "Importe",
    "payment_id_label": "ID de pago",
    "payment_try_again": "Si ves el cargo en tu cuenta, escríbenos e indica el ID anterior."
  },
  "collection": {
    "no_images_found": "No se han encontrado imágenes para esta colección"
  },
  "footer": {
    "title": "Contacta con Cillán para cualquier consulta",
    "comments": "Introduce tus comentarios",
    "send": "ENVIAR",
    "email": "Introduce tu correo electrónico"
  },
  "product": {
    "add_to_bag": "añadir a la cesta",
    "loading_product": "Cargando producto...",
    "product_not_found": "Producto no encontrado",
    "which_size": "¿Que talla debería elegir?",
    "select_size_validation": "Por favor, seleccione una talla antes de añadir a la cesta",
    "details": "Detalles",
    "materials": "Materiales",
    "garment_care": "Cuidado de la prenda"
  },
  "about": {
    "is_the": "es el",
    "inner_world": "mundo interior",
    "p_1_1": "de los niños, la dualidad entre lo complejo de desarrollar una personalidad y divertirse durante la infancia, darse cuenta que todas las referencias son válidas para enriquecerse y que nunca se es demasiado curioso. Entendido desde la ironía y el juego,",
    "never": "jamás",
    "p_1_2": "se deja de ser un niño.",
    "born_as": "nace como un",
    "alter_ego": "alter ego",
    "p_2": ", representa lo que se supone que se debe dejar atrás pero nos negamos a perderlo, es la versión oculta que todos tenemos en la vida adulta, es la creatividad la diversión y no tener prejuicios."
  },
  "legal_notice":{
    "title": "Aviso Legal",
    "last_updated": "Última actualización: 14 de Enero de 2026",
    "introduction": "Bienvenido al Aviso Legal de Cillan World S.L. (en adelante, \"Cillan World\" o \"la Empresa\"). Este documento establece los términos y condiciones legales bajo los cuales operamos nuestro sitio web y servicios asociados. Al acceder o utilizar nuestro sitio web, usted acepta cumplir con estos términos y condiciones.",
    "identification": "Identificación del Titular del Sitio Web",
    "titular_identification": "Identificacion del titular",
    "company_name": "Nombre y apellidos: Cillán García",
    "company_id": "NIF: 50249775L",
    "company_address": "Domicilio fiscal: Calle Lopez de Hoyos 124. 28002. Madrid, España",
    "contact_email": "Correo Electrónico de Contacto: cillan.world@gmail.com",
    "object": "Objeto",
    "p1": "Este aviso legal regula el uso del sitio web y los servicios ofrecidos por la entidad titular. A continuacion se detalla la informacion corporativa exigida por la normativa aplicable.",
    "p2_1": "El presente sitio web tiene como finalidad informar sobre los productos y permitir la compra de articulos ofrecidos por",
    "p2_2": "El acceso implica la aceptacion de las condiciones de uso publicadas en esta web.",
    "intellectual_property": "Propiedad Intelectual",
    "p3_1": "Los contenidos, imagenes, disenos y marcas son titularidad de",
    "p3_2": "o de terceros licenciantes. Queda prohibida su reproduccion sin autorizacion expresa.",
    "contact": "Contacto",
    "p4": "Para cualquier consulta relacionada con el sitio web o este aviso legal, escribe a"
  },
  "cookies_notice": {
    "title": "Uso de cookies",
    "last_updated": "Última actualización: 14 de Enero de 2026",
    "p1": "Esta politica describe las cookies utilizadas en este sitio web y las opciones disponibles para gestionarlas.Es coherente con el banner de cookies y cumple con RGPD y LSSI.",
    "what_are_cookies": "Qué son las cookies",
    "p2": "Las cookies son pequenos archivos que se almacenan en tu dispositivo y ayudan a recordar preferencias o a mejorar la experiencia de navegacion.",
    "cookies_we_use": "Cookies que usamos",
    "p3": "Actualmente solo utilizamos cookies tecnicas necesarias para el funcionamiento del sitio. No usamos cookies de analitica ni de publicidad.",
    "p4": "recuerda el idioma seleccionado. Duracion aproximada: 12 meses. Tipo: tecnica.",
    "third_party_cookies": "Cookies de terceros",
    "p5": "No instalamos cookies de terceros en este sitio web. Si en el futuro se incorporan, el banner solicitara tu consentimiento antes de activarlas.",
    "how_to_manage_cookies": "Cómo gestionar o bloquear cookies",
    "p6": "Puedes permitir, bloquear o eliminar las cookies desde la configuracion de tu navegador. Ten en cuenta que bloquear cookies tecnicas puede afectar al correcto funcionamiento del sitio.",
    "more_info": "Más información",
    "p7_1": "Para cualquier consulta sobre privacidad o cookies, escribe a ",
    "p7_2": "Puedes consultar tambien la",
    "contact_email": "cillan.world@gmail.com"
  },
  "terms_conditions": {
    "title": "Términos y Condiciones",
    "last_updated": "Última actualización: 14 de Enero de 2026",
    "p1": "Bienvenido al mundo CILLÁN. Al acceder y utilizar nuestro sitio web y/o realizar una compra, aceptas estar sujeto a los siguientes Términos y Condiciones. Te recomendamos leerlos detenidamente antes de usar nuestros servicios.",
    "subtitle1": "1. Información general",
    "p2": "Este sitio web es operado por Sergio Cillán García. En todo el sitio, los términos “nosotros”, “nuestro” o “la tienda” se refieren a CILLÁN.",
    "emails": "Email de contacto: cillan.world@gmail.com",
    "fiscal_direction": "Dirección física:  Calle Lopez de Hoyos 124. 28002",
    "subtitle2": "2. Uso del sitio web",
    "p3_1": "Al usar este sitio, declaras que tienes al menos 18 años o que tienes autorización legal para realizar compras online en tu país de residencia.",
    "p3_2": "No puedes usar nuestros productos con fines ilegales o no autorizados ni violar ninguna ley en tu jurisdicción (incluyendo, pero no limitado a, derechos de autor).",
    "subtitle3": "3. Productos y disponibilidad",
    "P4_1":"Todos los productos mostrados en nuestra tienda están sujetos a disponibilidad. Nos reservamos el derecho de retirar o modificar productos sin previo aviso.",
    "P4_2": "Los colores de los productos pueden variar ligeramente según la configuración de pantalla del usuario.",
    "subtitle4": "4. Precios y pagos",
    "P5_1": "Todos los precios están indicados en euros (€) e incluyen IVA, salvo que se indique lo contrario.",
    "P5_2": "Aceptamos pagos seguros a través de Braintree, mediante tarjetas de crédito y débito. El cargo se realizará en el momento de confirmar el pedido.",
    "subtitle5": "5. Envíos y entregas",
    "P6_1": "Los envíos se realizan a través de Correos. El tiempo de entrega estimado es de 7 a 10 días hábiles, desde la confirmación del pedido, debido a su producción bajo demanda.",
    "P6_2": "Los gastos de envío se calculan y muestran antes de finalizar la compra.",
    "subtitle6": "6. Cambios y devoluciones",
    "P7_1": "Aceptamos devoluciones dentro de un plazo de 14 días naturales desde la recepción del pedido, siempre que el producto no haya sido usado y esté en su embalaje original.",
    "P7_2": "Para solicitar una devolución, escríbenos a cillan.world@gmail.com indicando el número de pedido y motivo.",
    "P7_3": "Los gastos de envío de la devolución corren por cuenta del cliente, salvo que el producto esté defectuoso o haya habido un error por nuestra parte.",
    "subtitle7": "7. Propiedad intelectual",
    "P7": "Todo el contenido de este sitio (textos, imágenes, logotipos, diseño web, etc.) es propiedad de CILLÁN o cuenta con licencia de uso. Está prohibida su reproducción total o parcial sin autorización previa.",
    "subtitle8": "8. Responsabilidad",
    "P8_1": "No nos hacemos responsables de los daños derivados del uso indebido de los productos o del incumplimiento por parte del cliente de las instrucciones de cuidado, talla o uso.",
    "P8_2": "En ningún caso seremos responsables de pérdidas indirectas, beneficios perdidos o daños derivados de fallos técnicos del sitio web.",
    "subtitle9": "9. Protección de datos",
    "P9": "Respetamos tu privacidad y tratamos tus datos personales conforme a nuestra",
    "subtitle10": "10. Modificaciones",
    "P10": "Nos reservamos el derecho a modificar estos Términos y Condiciones en cualquier momento. Los cambios se harán efectivos desde su publicación en esta página.",
    "subtitle11": "11. Ley aplicable y jurisdicción",
    "P11": "Estas condiciones se rigen por la legislación española. En caso de conflicto, ambas partes acuerdan someterse a los juzgados y tribunales de Madrid, España], salvo disposición legal en contrario.",
    "subtitle12": "12. Contacto",
    "P12": "Para cualquier duda o reclamación, puedes escribirnos a:",
    "p12_1": "cillan.worls@gmail.com",
    "p12_2": "Calle Lopez de Hoyos 124. 28002",
    "privacy_policy": "Política de privacidad"
  },
  "privacy_policy": {
    "title": "Política de Privacidad",
    "last_updated": "Última actualización: 14 de Enero de 2026",
    "p1": "En CILLÁN (en adelante, “nosotros” o “la tienda”), nos tomamos muy en serio la protección de tus datos personales. Esta Política de Privacidad describe cómo recopilamos, usamos y protegemos tu información cuando navegas o realizas una compra en nuestro sitio web. Al utilizar nuestro sitio, aceptas las prácticas descritas en esta política.",
    "subtitle1": "1. ¿Quiénes somos?",
    "p2": "Somos una tienda online de ropa de diseñador y productos exclusivos. Puedes contactarnos a través de:" ,
    "p2_1": "Email: cillan.world@gmail.com",
    "p2_2": "Responsable del tratamiento:  Sergio Cillán García",
    "subtitle2": "2. ¿Qué datos personales recopilamos?",
    "p3": "Recopilamos la siguiente información cuando navegas por nuestro sitio o haces una compra:",
    "p3_1": "Nombre y apellidos" ,
    "p3_2": "Dirección de envío y facturación",
    "p3_3": "Correo electrónico",
    "p3_4": "Número de teléfono (opcional)",
    "p3_5": "Información de pago (a través de Braintree)",
    "p3_6": "Dirección IP y datos de navegación (automáticamente mediante cookies básicas)",
    "subtitle3": "3. ¿Para qué usamos tus datos?",
    "p4": "Usamos tus datos para:",
    "p4_1": "Procesar y gestionar tus pedidos" ,
    "p4_2": "Enviar confirmaciones y actualizaciones por email",
    "p4_3": "Atender tus consultas y solicitudes",
    "p4_4": "Cumplir obligaciones legales (facturación, devoluciones, etc.)",
    "p4_5": "Mejorar la experiencia de usuario en nuestra tienda",
    "subtitle4": "4. ¿Cuál es la base legal para tratar tus datos?",
    "p5": "Conforme al Reglamento General de Protección de Datos (RGPD), las bases legales son:",
    "p5_1": "Ejecución de un contrato (para tramitar tus pedidos)" ,
    "p5_2": "Consentimiento (cuando aceptas recibir comunicaciones)",
    "p5_3": "Obligación legal (retención de facturas, por ejemplo)",
    "p5_4": "Interés legítimo (prevención del fraude, mejora del servicio)",
    "subtitle5": "5. ¿Con quién compartimos tus datos?",
    "p6": "Solo compartimos tus datos con terceros esenciales para operar nuestra tienda:",
    "p6_1": "Braintree, Inc., para procesar los pagos. Puedes consultar su política de privacidad aquí: https://www.paypal.com/cy/legalhub/braintree/braintree-privacy-policy?utm_campaign=Braintree_Migration&utm_medium=Website&utm_source=Braintree#__Overview",
    "p6_2": "No vendemos ni cedemos tus datos personales a terceros con fines comerciales.",
    "subtitle6": "6. Uso de cookies",
    "p7": "Este sitio utiliza cookies técnicas necesarias para su funcionamiento. Actualmente no utilizamos cookies de terceros para análisis o publicidad. En caso de hacerlo, lo notificaremos adecuadamente y solicitaremos tu consentimiento.",
    "subtitle7": "7. ¿Cuáles son tus derechos?",
    "p8_1": "Puedes ejercer los siguientes derechos en cualquier momento:",
    "p8_2": "Acceder a tus datos personales",
    "p8_3": "Solicitar la rectificación o supresión de tus datos",
    "p8_4": "Limitar u oponerte al tratamiento",
    "p8_5": "Solicitar la portabilidad de los datos",
    "p8_6": "Retirar tu consentimiento, si lo diste previamente",
    "p8_7": "Para ejercerlos, escríbenos a cillan.world@gmail.com con el asunto “Protección de datos”.",
    "p8_8": "También puedes presentar una reclamación ante la Agencia Española de Protección de Datos: https://www.aepd.es",
    "subtitle8": "8. Seguridad de tus datos",
    "p9": "Adoptamos medidas técnicas y organizativas para proteger tus datos personales, incluyendo cifrado SSL, plataformas de pago seguras (como Braintree) y controles de acceso internos.",
    "subtitle9": "9. Conservación de los datos",
    "p10": "Conservamos tus datos solo el tiempo necesario para cumplir con las finalidades indicadas y con las obligaciones legales (como la conservación de facturas durante 5 años).",
    "subtitle10": "10. Cambios en esta política",
    "p11": "Nos reservamos el derecho a modificar esta política para adaptarla a novedades legislativas o técnicas. La fecha de la última actualización aparecerá al principio del documento.",
    "subtitle11": "11. Contacto",
    "p12": "Para cualquier duda relacionada con esta política, puedes escribirnos a:",
    "email": "cillan.world@gmail.com",
    "address": "Calle Lopez de Hoyos 124. 28002"

  }
}
