{
  "general": {
    "image_missing": "Falta la imagen",
    "cookies_policy": "politica de cookies",
    "legal_notice": "aviso legal",
    "terms_conditions": "términos y condiciones",
    "highlights": "destacados",
    "all_catalogue": "todo el catálogo",
    "loading": "Cargando...",
    "temporal_txt_checkout1": "Por el momento no es posible realizar compras directamente desde la web.",
    "temporal_txt_checkout2": "Si deseas realizar un pedido, contáctanos a través de ",
    "rights_reserved": "Todos los derechos reservados.",
    "contact": "contacto"
  },
  "navbar": {
    "shop": "tienda",
    "view_all": "ver todo",
    "tops": "prendas superiores",
    "bottoms": "prendas inferiores",
    "runaway_pieces": "piezas de pasarela",
    "universe": "universo",
    "about": "about"
  },
  "bag": {
    "your_bag": "Tu Cesta",
    "color": "Color",
    "bag_is_empty": "Tu cesta está vacía (por ahora)",
    "read_accepted": "Declaro haber leído y aceptado la",
    "privacy_policy": "política de privacidad",
    "privacy_required": "Debes aceptar la política de privacidad para continuar",
    "total": "Total",
    "checkout": "Finalizar compra",
    "checkout_error": "No hemos podido iniciar el pago. Inténtalo de nuevo.",
    "size": "Talla",
    "remove": "Eliminar",
    "success_title": "¡Gracias por tu compra!",
    "success_message": "Hemos recibido tu pedido y estamos procesándolo. Te enviaremos un correo electrónico de confirmación con los detalles de tu compra.",
    "success_back_to_shop": "Volver a la tienda",
    "item_added": "Producto añadido a tu cesta",
    "view_bag": "Ver cesta",
    "max_quantity_reached": "Se ha alcanzado la cantidad máxima para este artículo",
    "product_removed": "Producto eliminado de tu cesta",
    "payment_pending_title": "Estamos verificando tu pago",
    "payment_pending_message": "Tu sesión de pago todavía no figura como pagada. Si ya completaste el proceso, espera unos minutos o contacta con nosotros con el ID de pago.",
    "payment_failed_title": "No hemos podido confirmar tu pago",
    "payment_failed_message": "La sesión aparece como cancelada o fallida. Si crees que es un error, vuelve a intentarlo o escríbenos indicando el ID de pago.",
    "payment_status_label": "Estado",
    "payment_amount_label": "Importe",
    "payment_id_label": "ID de pago",
    "payment_try_again": "Si ves el cargo en tu cuenta, escríbenos e indica el ID anterior."
  },
  "collection": {
    "no_images_found": "No se han encontrado imágenes para esta colección"
  },
  "product": {
    "add_to_bag": "añadir a la cesta",
    "loading_product": "Cargando producto...",
    "product_not_found": "Producto no encontrado",
    "which_size": "¿Que talla debería elegir?",
    "select_size_validation": "Por favor, seleccione una talla antes de añadir a la cesta",
    "details": "Detalles",
    "materials": "Materiales",
    "garment_care": "Cuidado de la prenda"
  },
  "about": {
    "is_the": "es el",
    "inner_world": "mundo interior",
    "p_1_1": "de los niños, la dualidad entre lo complejo de desarrollar una personalidad y divertirse durante la infancia, darse cuenta que todas las referencias son válidas para enriquecerse y que nunca se es demasiado curioso. Entendido desde la ironía y el juego,",
    "never": "jamás",
    "p_1_2": "se deja de ser un niño.",
    "born_as": "nace como un",
    "alter_ego": "alter ego",
    "p_2": ", representa lo que se supone que se debe dejar atrás pero nos negamos a perderlo, es la versión oculta que todos tenemos en la vida adulta, es la creatividad la diversión y no tener prejuicios."
  },
  "legal_notice":{
    "title": "Aviso Legal",
    "last_updated": "Última actualización: 14 de Enero de 2026",
    "introduction": "Bienvenido al Aviso Legal de Cillan World S.L. (en adelante, \"Cillan World\" o \"la Empresa\"). Este documento establece los términos y condiciones legales bajo los cuales operamos nuestro sitio web y servicios asociados. Al acceder o utilizar nuestro sitio web, usted acepta cumplir con estos términos y condiciones.",
    "identification": "Identificación del Titular del Sitio Web",
    "titular_identification": "Identificacion del titular",
    "company_name": "Nombre y apellidos: Cillan World S.L.",
    "company_id": "NIF: B12345678",
    "company_address": "Domicilio fiscal: Calle de la Moda 123, 28001 Madrid, España",
    "contact_email": "Correo Electrónico de Contacto: cillan.world@gmail.com",
    "object": "Objeto",
    "p1": "Este aviso legal regula el uso del sitio web y los servicios ofrecidos por la entidad titular. A continuacion se detalla la informacion corporativa exigida por la normativa aplicable.",
    "p2_1": "El presente sitio web tiene como finalidad informar sobre los productos y permitir la compra de articulos ofrecidos por",
    "p2_2": "El acceso implica la aceptacion de las condiciones de uso publicadas en esta web.",
    "intellectual_property": "Propiedad Intelectual",
    "p3_1": "Los contenidos, imagenes, disenos y marcas son titularidad de",
    "p3_2": "o de terceros licenciantes. Queda prohibida su reproduccion sin autorizacion expresa.",
    "contact": "Contacto",
    "p4": "Para cualquier consulta relacionada con el sitio web o este aviso legal, escribe a"
  },
  "cookies_notice": {
    "title": "Uso de cookies",
    "last_updated": "Última actualización: 14 de Enero de 2026",
    "p1": "Esta politica describe las cookies utilizadas en este sitio web y las opciones disponibles para gestionarlas.Es coherente con el banner de cookies y cumple con RGPD y LSSI.",
    "what_are_cookies": "Qué son las cookies",
    "p2": "Las cookies son pequenos archivos que se almacenan en tu dispositivo y ayudan a recordar preferencias o a mejorar la experiencia de navegacion.",
    "cookies_we_use": "Cookies que usamos",
    "p3": "Actualmente solo utilizamos cookies tecnicas necesarias para el funcionamiento del sitio. No usamos cookies de analitica ni de publicidad.",
    "p4": "recuerda el idioma seleccionado. Duracion aproximada: 12 meses. Tipo: tecnica.",
    "third_party_cookies": "Cookies de terceros",
    "p5": "No instalamos cookies de terceros en este sitio web. Si en el futuro se incorporan, el banner solicitara tu consentimiento antes de activarlas.",
    "how_to_manage_cookies": "Cómo gestionar o bloquear cookies",
    "p6": "Puedes permitir, bloquear o eliminar las cookies desde la configuracion de tu navegador. Ten en cuenta que bloquear cookies tecnicas puede afectar al correcto funcionamiento del sitio.",
    "more_info": "Más información",
    "p7_1": "Para cualquier consulta sobre privacidad o cookies, escribe a ",
    "p7_2": "Puedes consultar tambien la",
    "contact_email": "cillan.world@gmail.com"
  },
  "terms_conditions": {
    "title": "Términos y Condiciones",
    "last_updated": "Última actualización: 14 de Enero de 2026",
    "p1_1": "Estas condiciones regulan el uso de la tienda online operada por",
    "p1_2": "desde",
    "p1_3": "Al acceder o comprar aceptas expresamente estos términos.",
    "emails": "Correos electrónicos",
    "fiscal_direction": "Dirección fiscal",
    "selling_conditions": "Condiciones de venta",
    "p2_1": "Todos los precios incluyen IVA en euros.",
    "p2_2": "El pedido se considera aceptado cuando recibes la confirmación de pago.",
    "p2_3": "Los pagos se procesan exclusivamente a través de Stripe.",
    "shipping_returns": "Envíos y devoluciones",
    "p3_1": "Trabajamos con",
    "p3_2": "El plazo estimado es de 2 a 5 días hábiles en España peninsular. Dispones de 14 días naturales para solicitar una devolución escribiendo a",
    "p3_3": "El producto debe estar en perfecto estado y con su embalaje original.",
    "intellectual_property": "Propiedad intelectual",
    "p4_1": "Todo el contenido del sitio (textos, imágenes, logotipos) pertenece a",
    "p4_2": "o a terceros licenciantes. No está permitido reutilizarlo sin autorización.",
    "data_protection": "Protección de datos",
    "p5": "Tratamos los datos personales conforme a nuestra",
    "applicable_law": "Ley aplicable",
    "p6": "Los presentes términos se rigen por la legislación española y cualquier disputa se resolverá ante los juzgados y tribunales de Madrid (España).",
    "contact_for_claims": "Contacto para reclamaciones",
    "contact": "Contacto"
  },
  "privacy_policy": {
    "title": "Política de Privacidad",
    "last_updated": "Última actualización: 14 de Enero de 2026",
    "p1_1": "En",
    "p1_2": "tratamos tus datos con arreglo al Reglamento General de Proteccion de Datos. Operamos desde",
    "p1_3": "y puedes contactarnos en",
    "p1_4": "Esta politica resume que datos recopilamos, para que los usamos y comopuedes ejercer tus derechos.",
    "data_collected": "Datos que recopilamos",
    "p2_1": "Datos identificativos (nombre, apellidos, correo y telefono opcional).",
    "p2_2": "Direcciones de envio y facturacion.",
    "p2_3": "Informacion de pago procesada integramente por proveedores de pago externos.",
    "p2_4": "Datos tecnicos de navegacion (IP, idioma, dispositivo) para mejorar el servicio.",
    "legal_base": "Finalidades y base legal",
    "p3_1": "Ejecucion del contrato: gestionar pedidos, envios, devoluciones y soporte.",
    "p3_2": "Obligaciones legales: facturacion y contabilidad.", 
    "p3_3": "Interes legitimo: mejorar el servicio, seguridad y prevenir fraudes.",
    "p3_4": "Consentimiento: envio de comunicaciones comerciales y promociones.",
    "data_processors": "Encargados y destinatarios",
    "p4_1": "Proveedores de pago externos para procesar tus transacciones de forma segura.",
    "p4_2": "Correos Express Paqueteria Urgente, S.A. para la logistica y entrega de pedidos.",
    "p4_3": "No vendemos ni cedemos datos personales a terceros con fines comerciales.",
    "user_rights": "Derechos de los usuarios",
    "p5_1": "Puedes solicitar acceso, rectificacion, supresion, limitacion, portabilidad u oposicion en cualquier momento enviando un correo a",
    "p5_2": "con el asunto \"Proteccion de datos\". Si consideras que no hemos atendido tus derechos, puedes presentar una reclamacion ante la Agencia Española de Proteccion de Datos.",
    "security_retention": "Seguridad y conservacion",
    "p6": "Aplicamos cifrado TLS, control de accesos y revisiones periodicas para proteger tus datos. Conservamos la informacion el tiempo imprescindible para prestar el servicio y cumplir obligaciones legales (p. ej., facturas durante cinco anos).",
    "contact": "Contacto",
    "email": "Email",
    "address": "Direccion"
  }
}
